In [1]:
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [2]:
#1
df=pd.read_csv("housingdata.csv")
df.head(6)

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
2  100003000.0           AP    2541654          NaN        1   850
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
5  100006000.0           TN   65465466          NaN        1   800

In [3]:
#2
column_names=list(df.columns)
column_names.insert(0,'')
new_df=pd.DataFrame(columns=column_names)
new_df=new_df.append(df)
new_df.reset_index(inplace=True)
new_df.rename(columns={'index':'Row Index'},inplace= True)
new_df

,Row Index,,PID,STATE,PRICE,NUM_BEDROOMS,NUM_BATH,SQ_FT
0,0,NaN,100001000.0,MP,321654,3,1,1000
1,1,NaN,100002000.0,MAHARASHTRA,21325,3,1.5,--
2,2,NaN,100003000.0,AP,2541654,NaN,1,850
3,3,NaN,100004000.0,TN,321321,1,NaN,700
4,4,NaN,NaN,TN,589465645,3,2,1600
5,5,NaN,100006000.0,TN,65465466,NaN,1,800
6,6,NaN,100007000.0,ASSAM,3222321,2,HURLEY,950
7,7,NaN,100008000.0,HP,23131,1,1,NaN
8,8,NaN,100009000.0,HP,21212,na,2,1800

In [4]:
#a) How many numbers of “STATE” exist in the dataset. Hint: use shape
#b) How many unique states exist in the dataset
print(df['STATE'].shape)
print(df['STATE'].unique())

(9,)
['MP' 'MAHARASHTRA' 'AP' 'TN' 'ASSAM' 'HP']

In [5]:
#Retrieve the list of all NaN/Null/Empty cells in the form of Boolean list
bool_df=df.isna()|df.isnull()|df.eq('')
print(bool_df)

     PID  STATE  PRICE  NUM_BEDROOMS  NUM_BATH  SQ_FT
0  False  False  False         False     False  False
1  False  False  False         False     False  False
2  False  False  False          True     False  False
3  False  False  False         False      True  False
4   True  False  False         False     False  False
5  False  False  False          True     False  False
6  False  False  False         False     False  False
7  False  False  False         False     False   True
8  False  False  False         False     False  False

In [6]:
##Drop all rows with N/A,NA,na values in Num_Bedrooms
df=df[~df['NUM_BEDROOMS'].isin(['na','NaN','N/A'])]
print(df)

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
2  100003000.0           AP    2541654          NaN        1   850
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
5  100006000.0           TN   65465466          NaN        1   800
6  100007000.0        ASSAM    3222321            2   HURLEY   950
7  100008000.0           HP      23131            1        1   NaN

In [7]:
#Replace the NaN and String entries in Num_Bath with previous entry
df['NUM_BATH']=pd.to_numeric(df['NUM_BATH'],errors='coerce')
df['NUM_BATH']=df['NUM_BATH'].fillna(method='ffill')
print(df)

           PID        STATE      PRICE NUM_BEDROOMS  NUM_BATH SQ_FT
0  100001000.0           MP     321654            3       1.0  1000
1  100002000.0  MAHARASHTRA      21325            3       1.5    --
2  100003000.0           AP    2541654          NaN       1.0   850
3  100004000.0           TN     321321            1       1.0   700
4          NaN           TN  589465645            3       2.0  1600
5  100006000.0           TN   65465466          NaN       1.0   800
6  100007000.0        ASSAM    3222321            2       1.0   950
7  100008000.0           HP      23131            1       1.0   NaN

In [8]:
import numpy as np

In [9]:
#Replace the empty values in “SQ_FT” with the mean of the all entries.
df['SQ_FT']=df['SQ_FT'].replace('--',np.nan)
df['SQ_FT']=df['SQ_FT'].astype(float)
mean_sqft=df['SQ_FT'].mean()
df['SQ_FT'].fillna(mean_sqft,inplace=True)
print(df)

           PID        STATE      PRICE NUM_BEDROOMS  NUM_BATH        SQ_FT
0  100001000.0           MP     321654            3       1.0  1000.000000
1  100002000.0  MAHARASHTRA      21325            3       1.5   983.333333
2  100003000.0           AP    2541654          NaN       1.0   850.000000
3  100004000.0           TN     321321            1       1.0   700.000000
4          NaN           TN  589465645            3       2.0  1600.000000
5  100006000.0           TN   65465466          NaN       1.0   800.000000
6  100007000.0        ASSAM    3222321            2       1.0   950.000000
7  100008000.0           HP      23131            1       1.0   983.333333

In [10]:
#What is the sum of SQ_FT of all entries in the dataset.
df['SQ_FT'].sum()

7866.666666666668

In [11]:
#Add a new column “NUM_STORE” and with all the values as 1 for all rows
df['NUM_STORE']=[1,1,1,1,1,1,1,1]
df

,PID,STATE,PRICE,NUM_BEDROOMS,NUM_BATH,SQ_FT,NUM_STORE
0,100001000.0,MP,321654,3,1.0,1000.000000,1
1,100002000.0,MAHARASHTRA,21325,3,1.5,983.333333,1
2,100003000.0,AP,2541654,NaN,1.0,850.000000,1
3,100004000.0,TN,321321,1,1.0,700.000000,1
4,NaN,TN,589465645,3,2.0,1600.000000,1
5,100006000.0,TN,65465466,NaN,1.0,800.000000,1
6,100007000.0,ASSAM,3222321,2,1.0,950.000000,1
7,100008000.0,HP,23131,1,1.0,983.333333,1

In [12]:
#Create a DataFrame containing all entries of TN state only
df_tn=df[df['STATE']=='TN']
df_tn=df_tn.reset_index()

df_tn.drop('index',axis=1,inplace=True)
df_tn

           PID STATE      PRICE NUM_BEDROOMS  NUM_BATH   SQ_FT  NUM_STORE
0  100004000.0    TN     321321            1       1.0   700.0          1
1          NaN    TN  589465645            3       2.0  1600.0          1
2  100006000.0    TN   65465466          NaN       1.0   800.0          1

In [13]:
#Create a DataFrame having SQ_FT area greater than 1000 and display the DataFrame
df1=df[df['SQ_FT']>1000.0]
df1=df1.reset_index()
df1.drop('index',axis=1,inplace=True)
df1

   PID STATE      PRICE NUM_BEDROOMS  NUM_BATH   SQ_FT  NUM_STORE
0  NaN    TN  589465645            3       2.0  1600.0          1

In [14]:
#Create a DataFrame having only first Three columns and First Three rows
df.iloc[0:3,0:3]

           PID        STATE    PRICE
0  100001000.0           MP   321654
1  100002000.0  MAHARASHTRA    21325
2  100003000.0           AP  2541654

In [15]:
#Display the state having highest average price per square foot of housing area.
state_prices=df.groupby('STATE')['PRICE','SQ_FT'].mean()
state_prices['pricepersqft']=state_prices['PRICE']/state_prices['SQ_FT']
state_prices=state_prices.sort_values('pricepersqft',ascending=True)
print(state_prices.index[-1])

TN